## Welcome to the Ajio Data Analaysis Project

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sys

In [5]:
Customer= pd.read_csv("customer.csv")
Delivery= pd. read_csv("delivery.csv")
Orders=pd.read_csv("orders.csv")
Rating=pd.read_csv("ratings.csv")
Returns= pd.read_csv("returns.csv")
Transaction = pd.read_csv("transaction.csv")
Products=pd.read_csv("products.csv")

In [6]:
Customer.head(2)

,C_ID,C_Name,Gender,Age,City,State,Street_Address,Mobile
0,CS_11000001,Manbir Lala,Male,67,Delhi,Delhi,"Park Ave, 163 , Delhi , Delhi - 529675",9607971039
1,CS_11000002,Radhika More,Female,51,Pune,Maharashtra,"Elm St, 960 , Pune , Maharashtra - 328062",9109249091

In [7]:
Delivery.head(2)

         DP_ID       DP_name  DP_Ratings  Percent_Cut
0  DV_61000001     Delhivery           5           25
1  DV_61000002  Ecom Express           4           20

In [9]:
Orders.head(2)

,Or_ID,C_ID,P_ID,Order_Date,Order_Time,Qty,Coupon,DP_ID,Discount
0,OR_31000001,CS_11005317,PD_21001301,2024-02-27,22:02:00,1,No Coupon,DV_61000001,0
1,OR_31000002,CS_11000423,PD_21003593,2024-01-21,08:33:31,5,PULL,DV_61000002,25

In [10]:
Rating.head(2)

           R_ID        Or_ID  Prod_Rating  Delivery_Service_Rating
0  RT_101000001  OR_31009479            4                        5
1  RT_101000002  OR_31001385            2                        2

In [11]:
Returns.head(2)

          RT_ID        Or_ID              Reason Return_Refund       Dates
0  RR_301000001  OR_31004141  Wrong Item Shipped      Approved  2023-04-08
1  RR_301000002  OR_31008145       Late Delivery      Rejected  2024-05-13

In [12]:
Products.head(2)

,P_ID,P_Name,Category,Company_Name,Gender,Price
0,PD_21000001,Distressed Stretch Denim Charcoal Faded Jeans,Jeans,Puma,Unisex,1589
1,PD_21000002,Straight Leg Cotton Blend Light Blue Faded Jeans,Jeans,Gap,Men,2211

In [13]:
Transaction.head(2)

         Tr_ID        Or_ID Transaction_Mode Reward
0  TR_41000001  OR_31002037           Wallet     No
1  TR_41000002  OR_31008376           Wallet    Yes